test_examples/tube_OpenFoam3d_abaqus3d/Test_pointDisplacement_Geometry_Based_Multiple_Time_Steps/0/pointDisplacement
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  4.x                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       pointVectorField;
    location    "0";
    object      pointDisplacement;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 0 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
	 ".*"
	 {
		 type            fixedValue;
	 	 value           uniform (0 0 0);
	 }


mantle
{
type fixedValue;
value  nonuniform List<vector>
1568
(
(0.0 -0.0 -6.123233995736766e-20)
(0.0 -0.0 0.0)
(0.0 -0.0 0.0)
(0.0 6.123233995736766e-20 -0.0)
(0.0 -0.0 0.0)
(0.0 6.005577771477988e-20 -1.1945836920349794e-20)
(0.0 -0.0 0.0)
(0.0 5.657130561442477e-20 -2.343260202653553e-20)
...
);
}
